{
    "Home": "Home",
    "Clasificación": "Classification",
    "Registros": "Records",
    "Estadísticas": "Statistics",
    "Perfil": "Profile",
    "Sobre nosotros": "About us",
    "Clasificador de Emociones": "Emotion Classifier",
    "CERRAR SESIÓN": "LOGOUT",

    "Contactos:": "Contacts:",
    "Teléfono celular:": "Cellular phone: +5356100659",
    "Email personal:": "Personal email: lesterenriquep7@gmail.com",
    "Teléfono casa:": "Home phone: 42282458",
    "Email institucional:": "Institutional email: lpcarballedo@uclv.cu",
    "Equipo de desarrollo": "Development team",
    "Clasificador de Emociones. Todos los derechos reservados.": "Emotion Classifier. All rights reserved.",

    "INICIAR SESIÓN": "LOGIN",
    "Iniciar sesión": "Login",
    "Registrarse": "Register",
    "Contraseña": "Password",

    "REGISTRO": "REGISTER",
    "Crear": "Create",
    "Regresar a Iniciar sesión": "Return to Login",
    "El nombre debe ser una cadena de texto.": "The name must be a text string.",
    "El nombre debe tener un máximo de 50 caracteres.": "The name must be a maximum of 50 characters.",
    "Los apellidos deben ser una cadena de texto.": "Last names must be a text string.",
    "Los apellidos deben tener un máximo de 50 caracteres.": "Last names must be a maximum of 50 characters.",
    "El Carné de Identidad debe contener exactamente 11 caracteres y solo números.": "The Identity Card must contain exactly 11 characters and only numbers.",
    "El teléfono debe tener 8 números y contener solo números.": "The phone must have 8 numbers and contain only numbers.",
    "El correo debe tener un formato de correo válido.": "The email must be in a valid email format.",
    "El correo debe tener un máximo de 100 caracteres.": "The email must have a maximum of 100 characters.",
    "El usuario debe contener solo caracteres alfanuméricos.": "The username must contain only alphanumeric characters.",
    "El usuario debe tener un mínimo de 5 caracteres.": "The username must be a minimum of 5 characters.",
    "El usuario debe tener un máximo de 20 caracteres.": "The username must be a maximum of 20 characters.",
    "La contraseña debe contener exactamente 8 caracteres, al menos una letra mayúscula, un dígito y un carácter especial.": "The password must contain exactly 8 characters, at least one uppercase letter, one digit, and one special character.",

    "Hola": "Hello",
    "Bienvenido": "Welcome to our innovative emotion classification system through face and voice. Here, you will discover powerful tools designed to analyze and understand human emotions with precision and efficiency. Get ready to transform the way you understand and manage emotions!",
    "Ver Más": "See More",
    "Explora": "Explore our advanced audio recording and photo taking section, designed for accurate emotion classification. Here, users can capture both their voice and facial expressions, providing rich data that allows our system to analyze and determine their emotions with high precision.",
    "Sumérgete": "Immerse yourself in this detailed section, where you will find audios and photos already classified ready to be reviewed. Here, users can access their voice recordings and facial captures, allowing a thorough review of previously analyzed emotions.",
    "Revisa": "Check out this section where the data collected from your logs is transformed into valuable information. Here, users can access detailed statistical data about their emotions, generated from voice recordings and classified facial captures.",

    "Clasificación de Emociones": "Classification of Emotions",
    "Iniciar Grabación": "Start Recording",
    "Continuar Grabación": "Continue Recording",
    "Pausar Grabación": "Pause Recording",
    "Procesar": "Process",
    "Guardar": "Save",
    "Cancelar": "Cancel",
    "Reiniciar": "Reboot",
    "Tiempo restante:": "Remaining time:",
    "segundos": "seconds",
    "Emoción del Audio": "Audio Emotion",
    "Emoción de las Fotos": "Emotion of Photos",
    "Emoción Combinado": "Combined Emotion",

    "Revisar": "Review",
    "Revisión de Emociones": "Review of Emotions",
    "Regresar": "Return",

    "Emoción del Audio:": "Audio Emotion:",
    "Emoción de las Fotos:": "Emotion of Photos:",
    "Emoción Combinado:": "Combined Emotion:",
    "Total de veces:": "Total times:",
    "Emociones del Audio:": "Audio Emotions:",
    "Emociones de las Fotos:": "Emotions from Photos:",
    "Emociones Combinado:": "Combined Emotions:",
    "Emoción Más Común": "Most Common Emotion",
    "Distribución de Emociones": "Distribution of Emotions",
    "Diversidad de Emociones": "Diversity of Emotions",
    "Asco": "Disgust",
    "Felicidad": "Happiness",
    "Ira": "Anger",
    "Miedo": "Fear",
    "Neutralidad": "Neutrality",
    "Tristeza": "Sadness",

    "Perfil del Usuario": "User Profile",
    "Nombre": "Name",
    "Apellido": "Last name",
    "CI": "IC",
    "Fecha de Nacimiento": "Birthdate",
    "Sexo": "Sex",
    "Dirección": "Address",
    "Teléfono": "Phone",
    "Correo electrónico": "Email",
    "Usuario": "User",
    "Masculino": "Male",
    "Femenino": "Female",

    "Bienvenido a nuestro proyecto": "Welcome to our emotion classification project! This innovative system was developed by a passionate student from the Universidad Central Marta Abreu de Las Villas (UCLV) as part of his final assignment for completing his studies. With dedication and enthusiasm, I create a comprehensive solution to meet the needs of detecting people's emotions through face and voice in any context.",
    "Equipo de Trabajo": "Work Team",
    "Nuestra Historia": "Our History",
    "Este proyecto nació": "This project was born as part of our academic training at UCLV. Guided by a passion for web programming and problem solving, we set out to create a tool that would simplify emotion detection. Throughout the process, we faced challenges, learned valuable lessons, and ultimately delivered a solution that we hope will be useful to companies in different fields.",
    "Nuestra Misión": "Our Mission",
    "En el corazón": "At the heart of our project is the desire to facilitate the emotion detection process. We believe in the importance of continuous learning and are committed to contributing to the growth and development of companies through our application.",
    "Desarrollador Web": "Web Developer",
    "Lester no solo": "Lester not only came up with the concept but also built each component in meticulous detail. From the design to the implementation of all the logic, their dedication and skill transformed an innovative idea into a powerful tool for emotion classification."
  }